; domain
(define (domain myDomain_phase1)
(:requirements :strips :equality :typing)
(:types 
Service - Thing
Capability
Design
BoronMaterial
PhosphorMaterial
SiliconMaterial
AluminumMaterial
ResistMaterial
PlasticMaterial
ChemicalsMaterial
CopperMaterial
Material
Boolean
State
Service_inv_in Service_des_uk Service_des_tw Service_inv_kz Service_inv_aus Service_inv_kr Service_inv_no Service_inv_cn Service_des_ch Service_inv_br Service_inv_ru Service_inv_au Service_inv_ma Service_inv_my Service_inv_bo Service_inv_ar Service_inv_be Service_inv_jp Service_des_us Service_inv_sv Service_inv_fr Service_inv_us Service_inv_tr Service_inv_pe Service_inv_cl Service_inv_ca - Service
)
(:predicates 
(provides ?srv - Service ?c - Capability) 
(taken ?o - Design ?b - Boolean)
(taken ?o - BoronMaterial ?b - Boolean)
(taken ?o - PhosphorMaterial ?b - Boolean)
(taken ?o - SiliconMaterial ?b - Boolean)
(taken ?o - AluminumMaterial ?b - Boolean)
(taken ?o - ResistMaterial ?b - Boolean)
(taken ?o - PlasticMaterial ?b - Boolean)
(taken ?o - ChemicalsMaterial ?b - Boolean)
(taken ?o - CopperMaterial ?b - Boolean)
(taken ?o - Material ?b - Boolean)
(status ?o - Service ?b - State)
)
(:functions (total-cost))
(:action take_aluminum_in
:parameters (?srv - Service_inv_in ?d - Design ?b - AluminumMaterial)
:precondition (and (provides ?srv taking_aluminum) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 13))
)
(:action take_resist_in
:parameters (?srv - Service_inv_in ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 13))
)
(:action take_plastic_in
:parameters (?srv - Service_inv_in ?d - Design ?p - PlasticMaterial)
:precondition (and (provides ?srv taking_plastic) (taken ?d true) (taken ?p false) (status ?srv available) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 13))
)
(:action take_design_uk
:parameters (?srv - Service_des_uk ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 6))
)
(:action take_design_tw
:parameters (?srv - Service_des_tw ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 12))
)
(:action take_boron_kz
:parameters (?srv - Service_inv_kz ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 10))
)
(:action take_resist_aus
:parameters (?srv - Service_inv_aus ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 8))
)
(:action take_wafer_kr
:parameters (?srv - Service_inv_kr ?d - Design ?w - Material)
:precondition (and (provides ?srv taking_wafer) (taken ?d true) (taken ?w false) (status ?srv available) )
:effect (and (taken ?w true) (not(taken ?w false)) (increase (total-cost) 10))
)
(:action take_silicon_no
:parameters (?srv - Service_inv_no ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 7))
)
(:action take_boron_cn
:parameters (?srv - Service_inv_cn ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 11))
)
(:action take_silicon_cn
:parameters (?srv - Service_inv_cn ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 11))
)
(:action take_phosphor_cn
:parameters (?srv - Service_inv_cn ?d - Design ?p - PhosphorMaterial)
:precondition (and (provides ?srv taking_phosphor) (taken ?d true) (taken ?p false) (status ?srv available) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 11))
)
(:action take_plastic_cn
:parameters (?srv - Service_inv_cn ?d - Design ?p - PlasticMaterial)
:precondition (and (provides ?srv taking_plastic) (taken ?d true) (taken ?p false) (status ?srv available) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 11))
)
(:action take_copper_cn
:parameters (?srv - Service_inv_cn ?d - Design ?b - CopperMaterial)
:precondition (and (provides ?srv taking_copper) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 11))
)
(:action take_design_cn
:parameters (?srv - Service_des_ch ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 11))
)
(:action take_silicon_br
:parameters (?srv - Service_inv_br ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 6))
)
(:action take_aluminum_br
:parameters (?srv - Service_inv_br ?d - Design ?b - AluminumMaterial)
:precondition (and (provides ?srv taking_aluminum) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 6))
)
(:action take_silicon_ru
:parameters (?srv - Service_inv_ru ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 9))
)
(:action take_boron_ru
:parameters (?srv - Service_inv_ru ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 9))
)
(:action take_aluminum_au
:parameters (?srv - Service_inv_au ?d - Design ?b - AluminumMaterial)
:precondition (and (provides ?srv taking_aluminum) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 14))
)
(:action take_phosphor_ma
:parameters (?srv - Service_inv_ma ?d - Design ?p - PhosphorMaterial)
:precondition (and (provides ?srv taking_phosphor) (taken ?d true) (taken ?p false) (status ?srv available) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 7))
)
(:action take_silicon_my
:parameters (?srv - Service_inv_my ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 14))
)
(:action take_boron_bo
:parameters (?srv - Service_inv_bo ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 6))
)
(:action take_boron_ar
:parameters (?srv - Service_inv_ar ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 8))
)
(:action take_resist_be
:parameters (?srv - Service_inv_be ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 7))
)
(:action take_wafer_jp
:parameters (?srv - Service_inv_jp ?d - Design ?w - Material)
:precondition (and (provides ?srv taking_wafer) (taken ?d true) (taken ?w false) (status ?srv available) )
:effect (and (taken ?w true) (not(taken ?w false)) (increase (total-cost) 10))
)
(:action take_design_us
:parameters (?srv - Service_des_us ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 1))
)
(:action take_resist_sv
:parameters (?srv - Service_inv_sv ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 8))
)
(:action take_silicon_fr
:parameters (?srv - Service_inv_fr ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 7))
)
(:action take_boron_us
:parameters (?srv - Service_inv_us ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_phosphor_us
:parameters (?srv - Service_inv_us ?d - Design ?p - PhosphorMaterial)
:precondition (and (provides ?srv taking_phosphor) (taken ?d true) (taken ?p false) (status ?srv available) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 1))
)
(:action take_silicon_us
:parameters (?srv - Service_inv_us ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 1))
)
(:action take_resist_us
:parameters (?srv - Service_inv_us ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_chemicals_us
:parameters (?srv - Service_inv_us ?d - Design ?b - ChemicalsMaterial)
:precondition (and (provides ?srv taking_chemicals) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_copper_us
:parameters (?srv - Service_inv_us ?d - Design ?b - CopperMaterial)
:precondition (and (provides ?srv taking_copper) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_boron_tr
:parameters (?srv - Service_inv_tr ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 10))
)
(:action take_copper_pe
:parameters (?srv - Service_inv_pe ?d - Design ?b - CopperMaterial)
:precondition (and (provides ?srv taking_copper) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 6))
)
(:action take_boron_cl
:parameters (?srv - Service_inv_cl ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 7))
)
(:action take_copper_cl
:parameters (?srv - Service_inv_cl ?d - Design ?b - CopperMaterial)
:precondition (and (provides ?srv taking_copper) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 7))
)
(:action take_resist_ca
:parameters (?srv - Service_inv_ca ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 2))
)
(:action take_chemicals_ca
:parameters (?srv - Service_inv_ca ?d - Design ?b - ChemicalsMaterial)
:precondition (and (provides ?srv taking_chemicals) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 2))
)

)

; problem
(define (problem myProblem_phase1)
(:domain myDomain_phase1)
(:objects 
design - Design
boron - BoronMaterial
phosphor - PhosphorMaterial
silicon - SiliconMaterial
aluminum - AluminumMaterial
resist - ResistMaterial
plastic - PlasticMaterial
chemicals - ChemicalsMaterial
copper - CopperMaterial
wafer - Material
true - Boolean
false - Boolean
available - State
broken - State
taking_aluminum - Capability
taking_resist - Capability
taking_plastic - Capability
taking_design - Capability
taking_boron - Capability
taking_wafer - Capability
taking_silicon - Capability
taking_phosphor - Capability
taking_copper - Capability
taking_chemicals - Capability
inventoryindia - Service_inv_in
designeruk - Service_des_uk
designertaiwan - Service_des_tw
inventorykazakhstan - Service_inv_kz
inventoryaustria - Service_inv_aus
inventorysouthkorea - Service_inv_kr
inventorynorway - Service_inv_no
inventorychina - Service_inv_cn
designerchina - Service_des_ch
inventorybrazil - Service_inv_br
inventoryrussia - Service_inv_ru
inventoryaustralia - Service_inv_au
inventorymorocco - Service_inv_ma
inventorymalaysia - Service_inv_my
inventorybolivia - Service_inv_bo
inventoryargentina - Service_inv_ar
inventorybelgio - Service_inv_be
inventoryjapan - Service_inv_jp
designerusa - Service_des_us
inventorysvizzera - Service_inv_sv
inventoryfrance - Service_inv_fr
inventoryusa - Service_inv_us
inventoryturkey - Service_inv_tr
inventoryperu - Service_inv_pe
inventorychile - Service_inv_cl
inventorycanada - Service_inv_ca
)
(:init 
(provides inventoryindia taking_aluminum)
(provides inventoryindia taking_resist)
(provides inventoryindia taking_plastic)
(provides designeruk taking_design)
(provides designertaiwan taking_design)
(provides inventorykazakhstan taking_boron)
(provides inventoryaustria taking_resist)
(provides inventorysouthkorea taking_wafer)
(provides inventorynorway taking_silicon)
(provides inventorychina taking_boron)
(provides inventorychina taking_silicon)
(provides inventorychina taking_phosphor)
(provides inventorychina taking_plastic)
(provides inventorychina taking_copper)
(provides designerchina taking_design)
(provides inventorybrazil taking_silicon)
(provides inventorybrazil taking_aluminum)
(provides inventoryrussia taking_silicon)
(provides inventoryrussia taking_boron)
(provides inventoryaustralia taking_aluminum)
(provides inventorymorocco taking_phosphor)
(provides inventorymalaysia taking_silicon)
(provides inventorybolivia taking_boron)
(provides inventoryargentina taking_boron)
(provides inventorybelgio taking_resist)
(provides inventoryjapan taking_wafer)
(provides designerusa taking_design)
(provides inventorysvizzera taking_resist)
(provides inventoryfrance taking_silicon)
(provides inventoryusa taking_boron)
(provides inventoryusa taking_phosphor)
(provides inventoryusa taking_silicon)
(provides inventoryusa taking_resist)
(provides inventoryusa taking_chemicals)
(provides inventoryusa taking_copper)
(provides inventoryturkey taking_boron)
(provides inventoryperu taking_copper)
(provides inventorychile taking_boron)
(provides inventorychile taking_copper)
(provides inventorycanada taking_resist)
(provides inventorycanada taking_chemicals)
(taken plastic false)
(taken chemicals false)
(taken design false)
(status inventoryindia available)
(status designeruk available)
(status designertaiwan available)
(status inventorykazakhstan available)
(status inventoryaustria available)
(taken phosphor false)
(status inventorysouthkorea available)
(taken silicon false)
(status inventorynorway available)
(status inventorychina available)
(taken boron false)
(status designerchina available)
(status inventorybrazil available)
(status inventoryrussia available)
(taken wafer false)
(status inventoryaustralia available)
(status inventorymorocco available)
(status inventorymalaysia available)
(status inventorybolivia available)
(status inventoryargentina available)
(status inventorybelgio available)
(status inventoryjapan available)
(status designerusa available)
(status inventorysvizzera available)
(status inventoryfrance available)
(status inventoryusa available)
(taken resist false)
(status inventoryturkey available)
(status inventoryperu available)
(taken aluminum false)
(status inventorychile available)
(taken copper false)
(status inventorycanada available)
(= (total-cost) 0)
)
(:goal 
(and 
(taken design true)
(taken boron true)
(taken phosphor true)
(taken silicon true)
(taken aluminum true)
(taken resist true)
(taken plastic true)
(taken chemicals true)
(taken copper true)
(taken design true)
)
)
(:metric minimize (total-cost))

)

; plan
1. (take_design_us designerusa design)
   deleted: (taken design false)
   added: (taken design true)
   goals met: 2 of 10
2. (take_plastic_cn inventorychina design plastic)
   deleted: (taken plastic false)
   added: (taken plastic true)
   goals met: 3 of 10
3. (take_aluminum_br inventorybrazil design aluminum)
   deleted: (taken aluminum false)
   added: (taken aluminum true)
   goals met: 4 of 10
4. (take_silicon_us inventoryusa design silicon)
   deleted: (taken silicon false)
   added: (taken silicon true)
   goals met: 5 of 10
5. (take_resist_us inventoryusa design resist)
   deleted: (taken resist false)
   added: (taken resist true)
   goals met: 6 of 10
6. (take_phosphor_us inventoryusa design phosphor)
   deleted: (taken phosphor false)
   added: (taken phosphor true)
   goals met: 7 of 10
7. (take_copper_us inventoryusa design copper)
   deleted: (taken copper false)
   added: (taken copper true)
   goals met: 8 of 10
8. (take_chemicals_us inventoryusa design chemicals)
   deleted: (taken chemicals false)
   added: (taken chemicals true)
   goals met: 9 of 10
9. (take_boron_us inventoryusa design boron)
   deleted: (taken boron false)
   added: (taken boron true)
   goals met: 10 of 10
